loadtest-results/20251112T181745Z/wrk.txt
Running 5s test @ https://rootly-waf/api/v1/plants
  4 threads and 40 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   520.08ms  896.49ms   3.85s    83.16%
    Req/Sec   654.20    440.10     2.63k    74.69%
  Latency Distribution
     50%   11.70ms
     75%  751.02ms
     90%    2.07s 
     99%    3.35s 
  10733 requests in 5.04s, 3.25MB read
  Non-2xx or 3xx responses: 10674
Requests/sec:   2128.36
Transfer/sec:    659.01KB